KevinWangJian/DuPower_SPC5775B_EMS/Targets/SPC5775B/MCAL/modules/Fls/include/Reg_eSys_FLASHC.h
/**
*   @file    Reg_eSys_FLASHC.h
*   @version 1.0.1
*
*   @brief   AUTOSAR Fls - Defines used to access the Flash registers.
*   @details This file contains defines used to access the Flash registers.
*
*   @addtogroup FLS
*   @{
*/
/*==================================================================================================
*   Project              : AUTOSAR 4.0 MCAL
*   Platform             : PA
*   Peripheral           : Flash_Memory
*   Dependencies         : 
*
*   Autosar Version      : 4.0.3
*   Autosar Revision     : ASR_REL_4_0_REV_0003
*   Autosar Conf.Variant :
*   SW Version           : 1.0.1
*   Build Version        : MPC5777C_MCAL_1_0_1_RTM_ASR_REL_4_0_REV_0003_20170519
*
*   (c) Copyright 2006-2016 Freescale Semiconductor, Inc. 
*       Copyright 2017 NXP
*   All Rights Reserved.
==================================================================================================*/
/*==================================================================================================
==================================================================================================*/

#ifndef REG_ESYS_FLASHC_H
#define REG_ESYS_FLASHC_H

#ifdef __cplusplus
extern "C"{
#endif

/**
* @page misra_violations MISRA-C:2004 violations
*
* @section Reg_eSys_FLASHC_H_REF_1
* Violates MISRA 2004 Required Rule 19.15, Repeated include files, Precautions shall be taken in
* order to prevent the contents of a header file being included twice This is not a violation since
* all header files are protected against multiple inclusions
*
* @section Reg_eSys_FLASHC_H_REF_2
* Violates MISRA 2004 Required Rule 5.1, Identifier exceeds 31 characters
*
* @section [global]
* Violates MISRA 2004 Required Rule 20.2, The names of standard library macros, objects and functions
* shall not be reused. The driver needs to use defines starting with letter E.
*
*/

/*==================================================================================================
*                                        INCLUDE FILES
* 1) system and project includes
* 2) needed interfaces from external units
* 3) internal and external interfaces from this unit
==================================================================================================*/

/**
* @violates @ref Reg_eSys_FLASHC_H_REF_1 MISRA 2004 Required Rule 19.15, Repeated include file
*/
#include "Reg_eSys.h"

/*==================================================================================================
*                              SOURCE FILE VERSION INFORMATION
==================================================================================================*/

#define ESYS_FLASHC_VENDOR_ID                           43
/* @violates @ref Reg_eSys_FLASHC_H_REF_2 Identifier exceeds 31 characters */
#define ESYS_FLASHC_AR_RELEASE_MAJOR_VERSION            4
/* @violates @ref Reg_eSys_FLASHC_H_REF_2 Identifier exceeds 31 characters */
#define ESYS_FLASHC_AR_RELEASE_MINOR_VERSION            0
/* @violates @ref Reg_eSys_FLASHC_H_REF_2 Identifier exceeds 31 characters */
#define ESYS_FLASHC_AR_RELEASE_REVISION_VERSION         3
#define ESYS_FLASHC_SW_MAJOR_VERSION                    1
#define ESYS_FLASHC_SW_MINOR_VERSION                    0
#define ESYS_FLASHC_SW_PATCH_VERSION                    1

#ifndef DISABLE_MCAL_INTERMODULE_ASR_CHECK
    #if ((ESYS_FLASHC_AR_RELEASE_MAJOR_VERSION != REG_ESYS_AR_RELEASE_MAJOR_VERSION) || \
         (ESYS_FLASHC_AR_RELEASE_MINOR_VERSION != REG_ESYS_AR_RELEASE_MINOR_VERSION) \
        )
        #error "AutoSar Version Numbers of Reg_eSys_FLASHC.h and Reg_eSys.h are different"
    #endif
#endif
/*==================================================================================================
*                                          CONSTANTS
==================================================================================================*/
#define IPV_FLASHV2_C55FG_4096          (0x01000305UL)    /* for XPC564xM platform */
#define IPV_FLASHV2_C55FM_2560          (0x25608600UL)    /* for MPC5744P platform */
#define IPV_FLASHV2_C55FM_4096          (0x40965519UL)    /* for MPC5775N platform */
#define IPV_FLASHV2_C55FM_8192          (0x01000802UL)    /* for MPC5777M platform */
#define IPV_FLASHV2_C55FM_4272          (0x42565538UL)    /* for MPC574XR platform */
#define IPV_FLASHV2_C55FM_6144          (0x62725539UL)    /* for MPC574XG platform */
#define IPV_FLASHV2_C55FM_8480          (0x84803202UL)    /* for MPC5777C platform */
#define IPV_FLASHV2_C55FM_4096K         (0x40965546UL)    /* for MPC5775K platform */
#define IPV_FLASHV2_C55FM_2048          (0x20485546UL)    /* for S32R274 platform */  



#define FLASH_BASEADDR      (FMCR_BASEADDR)  /** @brief Flash register base address  */
#define FLASH_MCR_OFFSET    ((uint32)0x00UL) /** @brief Module Configuration Register (MCR) address offset  */

/* memory array control/configuration registers */
#define FLASH_MCR_ADDR32    ((uint32)(FLASH_BASEADDR + (uint32)0x00UL)) /**< @brief Module Configuration Register (MCR) */
#define FLASH_MCRA_ADDR32   ((uint32)(FLASH_BASEADDR + (uint32)0x04UL)) /**< @brief Alternate Module Configuration Register (MCRA) */
#define FLASH_MCRE_ADDR32   ((uint32)(FLASH_BASEADDR + (uint32)0x08UL)) /**< @brief Extended Module Configuration Register (MCRE) */
#define FLASH_LOCK0_ADDR32  ((uint32)(FLASH_BASEADDR + (uint32)0x10UL)) /**< @brief Lock 0 Register - Test, Low/Middle Block address space (LOCK0) */ 
#define FLASH_LOCK1_ADDR32  ((uint32)(FLASH_BASEADDR + (uint32)0x14UL)) /**< @brief Lock 1 Register - High Block address space (LOCK1) */
#define FLASH_LOCK2_ADDR32  ((uint32)(FLASH_BASEADDR + (uint32)0x18UL)) /**< @brief Lock 2 Register - 256 KByte Block address space (LOCK2) */
#define FLASH_LOCK3_ADDR32  ((uint32)(FLASH_BASEADDR + (uint32)0x1CUL)) /**< @brief Lock 3 Register - 256 KByte Block address space (LOCK3) */
#define FLASH_LOCK0A_ADDR32 ((uint32)(FLASH_BASEADDR + (uint32)0x20UL)) /**< @brief Alternate Lock 0 Register - Test, Low/Middle Block address space (LOCK0A) */
#define FLASH_LOCK1A_ADDR32 ((uint32)(FLASH_BASEADDR + (uint32)0x24UL)) /**< @brief Alternate Lock 1 Register - High Block address space (LOCK1A) */
#define FLASH_SEL0_ADDR32   ((uint32)(FLASH_BASEADDR + (uint32)0x38UL)) /**< @brief Select 0 Register - Low/Middle Block address space (SEL0) */
#define FLASH_SEL1_ADDR32   ((uint32)(FLASH_BASEADDR + (uint32)0x3CUL)) /**< @brief Select 1 Register - High Block address space (SEL1) */  
#define FLASH_SEL2_ADDR32   ((uint32)(FLASH_BASEADDR + (uint32)0x40UL)) /**< @brief Select 2 Register - 256 KByte Block address space (SEL2) */
#define FLASH_SEL3_ADDR32   ((uint32)(FLASH_BASEADDR + (uint32)0x44UL)) /**< @brief Select 3 Register - 256 KByte Block address space (SEL3) */
#define FLASH_ADR_ADDR32    ((uint32)(FLASH_BASEADDR + (uint32)0x50UL)) /**< @brief Address Register (ADR) */
#define FLASH_UT0_ADDR32    ((uint32)(FLASH_BASEADDR + (uint32)0x54UL)) /**< @brief User Test 0 register (UT0) */



