KevinWangJian/DuPower_SPC5775B_EMS/Targets/SPC5775B/MCAL/modules/Fls/include/Reg_eSys_FLASHC.h
/* PFC (Platform Flash Controller) control/configuration registers */
#define FLASH_PFCR1 0x0000U /**< @brief Platform Flash Configuration Register 1 (PFCR1) */
#define FLASH_PFCR2 0x0001U /**< @brief Platform Flash Configuration Register 2 (PFCR2) */
#define FLASH_PFCR3 0x0002U /**< @brief Platform Flash Configuration Register 3 (PFCR3) */
#define FLASH_PFAPR 0x0003U /**< @brief Platform Flash Access Protection Register (PFAPR) */

/* MCR register bits */
#define FLASH_MCR_RVE_U32   0x80000000U  /**< @brief RVE:   Read Voltage Error (Read/Clear) */
#define FLASH_MCR_RRE_U32   0x40000000U  /**< @brief RRE:   Read Reference Error (Read/Clear) */
#define FLASH_MCR_EER_U32   0x00008000U  /**< @brief EER:   Ecc event ERror (Read/Clear) */
#define FLASH_MCR_RWE_U32   0x00004000U  /**< @brief RWE:   Read-while-Write event Error (Read/Clear) */
#define FLASH_MCR_SBC_U32   0x00002000U  /**< @brief SBC:   Single Bit Correction (Read/Clear) */
#define FLASH_MCR_PEAS_U32  0x00000800U  /**< @brief PEAS:  Program/Erase Access Space (Read Only) */
#define FLASH_MCR_DONE_U32  0x00000400U  /**< @brief DONE:  modify operation DONE (Read Only) */
#define FLASH_MCR_PEG_U32   0x00000200U  /**< @brief PEG:   Program/Erase Good (Read Only) */
#define FLASH_MCR_PECIE_U32 0x00000100U  /**< @brief PECIE: Program/Erase Complete Interrupt Enable (Read Only) */
#define FLASH_MCR_FERS_U32  0x00000080U  /**< @brief FERS:  Factory Erase (Read Only) */
#define FLASH_MCR_PGM_U32   0x00000010U  /**< @brief PGM:   ProGraM (Read/Write) */
#define FLASH_MCR_PSUS_U32  0x00000008U  /**< @brief PSUS:  Program SUSpend (Read/Write) */
#define FLASH_MCR_ERS_U32   0x00000004U  /**< @brief ERS:   ERaSe (Read/Write) */
#define FLASH_MCR_ESUS_U32  0x00000002U  /**< @brief ESUS:  Erase SUSpend (Read/Write) */
#define FLASH_MCR_EHV_U32   0x00000001U  /**< @brief EHV:   Enable High Voltage (Read/Write) */

/* MCR register bits - masks for W1C operations */
#define FLASH_MCR_RVE_W1C   (FLASH_MCR_RVE_U32)
#define FLASH_MCR_RRE_W1C   (FLASH_MCR_RRE_U32)
#define FLASH_MCR_EER_W1C   (FLASH_MCR_EER_U32)
#define FLASH_MCR_RWE_W1C   (FLASH_MCR_RWE_U32)
#define FLASH_MCR_SBC_W1C   (FLASH_MCR_SBC_U32)

/* LOCK0 - Low/Middle Block Lock register bits */
#define FLASH_LML_TSLK_U32  0x80000000U  /**< @brief TSLK: Test/Shadow address space block LocK (Read/Write) */
#define FLASH_LML_LLK29_U32 0x20000000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK28_U32 0x10000000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK27_U32 0x08000000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK26_U32 0x04000000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK25_U32 0x02000000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK24_U32 0x01000000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK23_U32 0x00800000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK22_U32 0x00400000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK21_U32 0x00200000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK20_U32 0x00100000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK19_U32 0x00080000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK18_U32 0x00040000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK17_U32 0x00020000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_LLK16_U32 0x00010000U  /**< @brief LLK29-0: Low address space block LocK 29-0 (Read/Write) */
#define FLASH_LML_MLK15_U32 0x00008000U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK14_U32 0x00004000U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK13_U32 0x00002000U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK12_U32 0x00001000U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK11_U32 0x00000800U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK10_U32 0x00000400U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK9_U32  0x00000200U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK8_U32  0x00000100U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK7_U32  0x00000080U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK6_U32  0x00000040U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK5_U32  0x00000020U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK4_U32  0x00000010U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK3_U32  0x00000008U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK2_U32  0x00000004U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK1_U32  0x00000002U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */
#define FLASH_LML_MLK0_U32  0x00000001U  /**< @brief MLK29-0: Mid address space block LocK 29-0(Read/Write) */

/* LOCK1 - High Block Lock register bits */
#define FLASH_HBL_HLK15_U32 0x00008000U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK14_U32 0x00004000U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK13_U32 0x00002000U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK12_U32 0x00001000U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK11_U32 0x00000800U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK10_U32 0x00000400U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK9_U32  0x00000200U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK8_U32  0x00000100U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK7_U32  0x00000080U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK6_U32  0x00000040U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK5_U32  0x00000020U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK4_U32  0x00000010U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK3_U32  0x00000008U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK2_U32  0x00000004U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK1_U32  0x00000002U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */
#define FLASH_HBL_HLK0_U32  0x00000001U  /**< @brief HLK15-0: High address space block LocK 15-0 (Read/Write) */

