KevinWangJian/DuPower_SPC5775B_EMS/Targets/SPC5775B/MCAL/modules/Fls/include/Reg_eSys_FLASHC.h
/* LOCK2 - Large Block Lock register bits */
#define FLASH_LGBL_LGLK31_U32 0x80000000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK30_U32 0x40000000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK29_U32 0x20000000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK28_U32 0x10000000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK27_U32 0x08000000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK26_U32 0x04000000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK25_U32 0x02000000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK24_U32 0x01000000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK23_U32 0x00800000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK22_U32 0x00400000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK21_U32 0x00200000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK20_U32 0x00100000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK19_U32 0x00080000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK18_U32 0x00040000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK17_U32 0x00020000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK16_U32 0x00010000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK15_U32 0x00008000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK14_U32 0x00004000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK13_U32 0x00002000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK12_U32 0x00001000U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK11_U32 0x00000800U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK10_U32 0x00000400U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK9_U32  0x00000200U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK8_U32  0x00000100U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK7_U32  0x00000080U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK6_U32  0x00000040U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK5_U32  0x00000020U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK4_U32  0x00000010U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK3_U32  0x00000008U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK2_U32  0x00000004U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK1_U32  0x00000002U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */
#define FLASH_LGBL_LGLK0_U32  0x00000001U  /**< @brief HLK31-0: Large address space block LocK 31-0 (Read/Write) */

/* SEL0 - Low/Middle Block Select register bits */
#define FLASH_LMS_TSSL_U32    0x80000000U  /**< @brief TSLK: Test/Shadow address space block SeLect (Read/Write) */
#define FLASH_LMS_LSL29_U32   0x20000000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL28_U32   0x10000000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL27_U32   0x08000000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL26_U32   0x04000000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL25_U32   0x02000000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL24_U32   0x01000000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL23_U32   0x00800000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL22_U32   0x00400000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL21_U32   0x00200000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL20_U32   0x00100000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL19_U32   0x00080000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL18_U32   0x00040000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL17_U32   0x00020000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_LSL16_U32   0x00010000U  /**< @brief LSL29-0: Low address space block SeLect 29-0 (Read/Write) */
#define FLASH_LMS_MSL15_U32   0x00008000U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL14_U32   0x00004000U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL13_U32   0x00002000U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL12_U32   0x00001000U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL11_U32   0x00000800U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL10_U32   0x00000400U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL9_U32    0x00000200U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL8_U32    0x00000100U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL7_U32    0x00000080U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL6_U32    0x00000040U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL5_U32    0x00000020U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL4_U32    0x00000010U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL3_U32    0x00000008U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL2_U32    0x00000004U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL1_U32    0x00000002U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */
#define FLASH_LMS_MSL0_U32    0x00000001U  /**< @brief MSL29-0: Mid address space block SeLect 29-0(Read/Write) */

/* SEL1 - High Block Select register bits */
#define FLASH_HBS_HSL15_U32   0x00008000U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL14_U32   0x00004000U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL13_U32   0x00002000U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL12_U32   0x00001000U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL11_U32   0x00000800U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL10_U32   0x00000400U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL9_U32    0x00000200U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL8_U32    0x00000100U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL7_U32    0x00000080U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL6_U32    0x00000040U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL5_U32    0x00000020U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL4_U32    0x00000010U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL3_U32    0x00000008U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL2_U32    0x00000004U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL1_U32    0x00000002U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */
#define FLASH_HBS_HSL0_U32    0x00000001U  /**< @brief MSL15-0: High address space block SeLect 15-0(Read/Write) */

/* SEL2 - Large Block Select register bits */
#define FLASH_LGBS_LGSL31_U32 0x80000000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL30_U32 0x40000000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL29_U32 0x20000000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL28_U32 0x10000000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL27_U32 0x08000000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL26_U32 0x04000000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL25_U32 0x02000000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL24_U32 0x01000000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL23_U32 0x00800000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL22_U32 0x00400000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL21_U32 0x00200000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL20_U32 0x00100000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL19_U32 0x00080000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL18_U32 0x00040000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL17_U32 0x00020000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL16_U32 0x00010000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL15_U32 0x00008000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL14_U32 0x00004000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL13_U32 0x00002000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL12_U32 0x00001000U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL11_U32 0x00000800U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL10_U32 0x00000400U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL9_U32  0x00000200U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL8_U32  0x00000100U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL7_U32  0x00000080U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL6_U32  0x00000040U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL5_U32  0x00000020U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL4_U32  0x00000010U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL3_U32  0x00000008U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL2_U32  0x00000004U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL1_U32  0x00000002U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */
#define FLASH_LGBS_LGSL0_U32  0x00000001U  /**< @brief LGSL31-0: Large address space block SeLect 31-0 (Read/Write) */

/* UT0 register bits */
#define FLASH_UT0_AIE_U32     0x00000002U  /**< @brief AIE: Array Integrity Enable (Read/Write) */

#ifdef __cplusplus
}
#endif

#endif /*REG_ESYS_FLASHC_H*/

/** @} */

